# ProblemRegeneratingInGroupUpdate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..ProblemRegeneratingInGroupUpdate Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to regenerate while updating groups at end of transaction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProblemRegeneratingInGroupUpdate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProblemRegeneratingInGroupUpdate As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProblemRegeneratingInGroupUpdate {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace